Revit 2027 API
ParameterTypeId.BoundaryDirectionRotZ Property
 "Z Rotation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryDirectionRotZ { get; }
Public Shared ReadOnly Property BoundaryDirectionRotZ As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryDirectionRotZ {
	ForgeTypeId^ get ();
}
static member BoundaryDirectionRotZ : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace